# Pandas Exercise (10 points)

The homework assignment is due by the end of the day on Thursday, October 3.

You are expected to solve the assignment problems independently and adhere to the university's policies for academic honesty and integrity. Copying solutions to the assignment problems from your classmates, the internet, or anywhere else is strictly prohibited.

To avoid potential conflicts between variable names in your notebook, it is recommended to restart the kernel often or for every new problem by selecting `Kernel -> Restart Kernel...`. Also, when you complete all problems and before submitting the notebook, ensure that all cells have been executed without errors by selecting `Kernel -> Restart Kernel and Run All Cells...`.

**Note that your solutions are expected to follow the code examples provided in the lecture notes. If your solution to a problem uses functions or codes that are not covered in the lecture notes, that will result in zero marks assigned for that problem.**

Pandas exercise: 10 points

Total points for Assignment 3: 25 points

For this exercise, we will use the file `financial_report.csv` in the `data` folder, which provides information about financial institutions in the USA, and has information about their name, city, state, certificates, etc.

## Part 1. Importing Data (2 points)

(1.1) Import the table `financial_report.csv` as a dataframe `df1`. Note again that it is located in the `data` folder.

In [1]:
# Your code here

(1.2) Display the summary information about the dataframe. How many rows and columns are in the dataframe?

In [ ]:
# Your code here

(1.3) Display the first 10 rows of the table, using the `head()` function.

In [3]:
# Your code here

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17
5,Harvest Community Bank,Pennsville,NJ,34951,First-Citizens Bank & Trust Company,13-Jan-17,18-May-17
6,Allied Bank,Mulberry,AR,91,Today's Bank,23-Sep-16,17-Nov-16
7,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,19-Aug-16,1-Jun-17
8,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,6-May-16,6-Sep-16
9,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,29-Apr-16,6-Sep-16

(1.4) Display the last 20 rows of the table, using the `tail()` function.

In [ ]:
# Your code here

(1.5) Display the column names (using the `.columns` attribute).

In [5]:
# Your code here

Index(['Bank Name', 'City', 'ST', 'CERT', 'Acquiring Institution',
       'Closing Date', 'Updated Date'],
      dtype='object')

## Part 2. Column Manipulation (2 points)

(2.1) Create a new column in the dataframe called `'City, ST'` by adding City and State information (e.g., Saint Elmo, IL). Display the head of the resulting dataframe.

In [6]:
# Your code here

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17,"Chicago, IL"

(2.2) Change the name of the column `CERT` to `Certificates`. Display the head of the dataframe.

In [7]:
# Your code here

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,Updated Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17,"New Orleans, LA"

(2.3) Create a pandas series object called `series1` from the column `Acquiring Institution`. Confirm the type of `series1`.

In [8]:
# Your code here

pandas.core.series.Series

(2.4) Delete the column `'Updated Date'` from the dataframe. Display the head.

In [9]:
# Your code here

,Bank Name,City,ST,Certificates,Acquiring Institution,Closing Date,"City, ST"
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,"Saint Elmo, IL"
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,"Milwaukee, WI"
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,"New Orleans, LA"
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,"Cottonwood Heights, UT"
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,"Chicago, IL"

(2.5) Reorder the columns so that the `City, ST` column is after the `ST` column.

In [10]:
# Your code here

,Bank Name,City,ST,"City, ST",Certificates,Acquiring Institution,Closing Date
0,Fayette County Bank,Saint Elmo,IL,"Saint Elmo, IL",1802,"United Fidelity Bank, fsb",26-May-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,"Milwaukee, WI",30003,First-Citizens Bank & Trust Company,5-May-17
2,First NBC Bank,New Orleans,LA,"New Orleans, LA",58302,Whitney Bank,28-Apr-17
3,Proficio Bank,Cottonwood Heights,UT,"Cottonwood Heights, UT",35495,Cache Valley Bank,3-Mar-17
4,Seaway Bank and Trust Company,Chicago,IL,"Chicago, IL",19328,State Bank of Texas,27-Jan-17

## Part 3. Information Retrieval (4 points)

(3.1) How many different states have banks in this dataset?

In [11]:
# Your code here

44

(3.2) Display all the states in the `ST` column.

In [12]:
# Your code here

array(['IL', 'WI', 'LA', 'UT', 'NJ', 'AR', 'GA', 'PA', 'TN', 'WA', 'CO',
       'PR', 'FL', 'MN', 'CA', 'MD', 'OK', 'OH', 'SC', 'VA', 'ID', 'TX',
       'CT', 'AZ', 'NV', 'NC', 'KY', 'MO', 'KS', 'AL', 'MI', 'IN', 'IA',
       'NE', 'MS', 'NM', 'OR', 'NY', 'MA', 'SD', 'WY', 'WV', 'NH', 'HI'],
      dtype=object)

(3.3) Display the number of acquisitions for each acquiring institution.

In [13]:
# Your code here

No Acquirer                            31
State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
                                       ..
BankSouth                               1
McFarland State Bank                    1
Bank 7                                  1
Farmers & Merchants Savings Bank        1
Bank of the Orient                      1
Name: Acquiring Institution, Length: 286, dtype: int64

(3.4) Display the top 4 acquiring institutions (ignore 'No Acquirer') and the number of acquisitions for each of them.

In [14]:
# Your code here

State Bank and Trust Company           12
First-Citizens Bank & Trust Company    11
Ameris Bank                            10
U.S. Bank N.A.                          9
Name: Acquiring Institution, dtype: int64

(3.5) Display the number of acquisitions for each acquiring institution in alphabetical order.

In [15]:
# Your code here

1st United Bank                        3
Advantage National Bank Group          1
Alerus Financial, N.A.                 2
Allegheny Valley Bank of Pittsburgh    1
Alma Bank                              1
                                      ..
Whidbey Island Bank                    2
Whitney Bank                           1
Wilshire State Bank                    1
Xenith Bank                            1
Your Community Bank                    1
Name: Acquiring Institution, Length: 286, dtype: int64

(3.6) Are there any missing values in the dataframe?

In [16]:
# Your code here

Bank Name                0
City                     0
ST                       0
City, ST                 0
Certificates             0
Acquiring Institution    0
Closing Date             0
dtype: int64

(3.7) How many `Certificates` values are above 20,000?

In [17]:
# Your code here

417

(3.8) Create a new dataframe called `df2` from df1, by selecting only the banks with more than 20,000 certificates. Print the summary statistics for the dataframe `df2`.

In [20]:
# Your code here

<class 'pandas.core.frame.DataFrame'>
Int64Index: 417 entries, 1 to 550
Data columns (total 7 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   Bank Name              417 non-null    object
 1   City                   417 non-null    object
 2   ST                     417 non-null    object
 3   City, ST               417 non-null    object
 4   Certificates           417 non-null    int64
 5   Acquiring Institution  417 non-null    object
 6   Closing Date           417 non-null    object
dtypes: int64(1), object(6)
memory usage: 26.1+ KB

(3.9) Display all the banks that Centennial Bank has acquired.

In [21]:
# Your code here

,Bank Name,City,ST,"City, ST",Certificates,Acquiring Institution,Closing Date
64,Heritage Bank of Florida,Lutz,FL,"Lutz, FL",35009,Centennial Bank,2-Nov-12
214,Gulf State Community Bank,Carrabelle,FL,"Carrabelle, FL",20340,Centennial Bank,19-Nov-10
233,Wakulla Bank,Crawfordville,FL,"Crawfordville, FL",21777,Centennial Bank,1-Oct-10
255,Coastal Community Bank,Panama City Beach,FL,"Panama City Beach, FL",9619,Centennial Bank,30-Jul-10
256,Bayside Savings Bank,Port Saint Joe,FL,"Port Saint Joe, FL",57669,Centennial Bank,30-Jul-10
322,Key West Bank,Key West,FL,"Key West, FL",34684,Centennial Bank,26-Mar-10
332,Old Southern Bank,Orlando,FL,"Orlando, FL",58182,Centennial Bank,12-Mar-10

## Part 4. Groups (2 points)

(4.1) Create a new column called `'CA_bank'` which contains Boolean `True` or `False` values to indicate if the bank is in California or not.

In [23]:
# Your code here

,Bank Name,City,ST,"City, ST",Certificates,Acquiring Institution,Closing Date,CA_bank
0,Fayette County Bank,Saint Elmo,IL,"Saint Elmo, IL",1802,"United Fidelity Bank, fsb",26-May-17,False
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,"Milwaukee, WI",30003,First-Citizens Bank & Trust Company,5-May-17,False
2,First NBC Bank,New Orleans,LA,"New Orleans, LA",58302,Whitney Bank,28-Apr-17,False
3,Proficio Bank,Cottonwood Heights,UT,"Cottonwood Heights, UT",35495,Cache Valley Bank,3-Mar-17,False
4,Seaway Bank and Trust Company,Chicago,IL,"Chicago, IL",19328,State Bank of Texas,27-Jan-17,False

(4.2) Use `groupby` to find the number of banks in each city in California, based on the newly created column `'CA_bank'`. Sort the numbers in descending order (i.e., the city with the most banks is on top).

In [24]:
# Your code here

City
Los Angeles      4
Palm Desert      2
San Francisco    2
Newport Beach    2
La Jolla         2
                ..
Gaithersburg     0
Freedom          0
Franklin         0
Fort Pierce      0
Wyoming          0
Name: CA_bank, Length: 424, dtype: int64

(4.3) Use `groupby` to find which acquiring institution has the most acquisitions in California.

In [25]:
# Your code here

Acquiring Institution
OneWest Bank, FSB                             3
First California Bank                         3
U.S. Bank N.A.                                3
Pacific Western Bank                          3
California Bank & Trust                       2
                                             ..
First State Bank                              0
First State Bank of St. Joseph                0
First Tennessee Bank, National Association    0
FirstAtlantic Bank                            0
Your Community Bank                           0
Name: CA_bank, Length: 286, dtype: int64